itskovichanton/pianoledvst3/bridge/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Консоль — UART0 (на C6 DevKit она никуда не выведена). USB Serial/JTAG
# остаётся свободным для драйвера: так же, как в примере usb_serial_jtag_echo.
# Если отдать USB-JTAG консоли, ESP_LOG и boot-логи врежутся в кадры пикселей.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y

# Логи никуда не пишутся, но и собирать их незачем — экономим флеш.
# Диагностика хосту уходит кадрами LED_FRAME_LOG.
CONFIG_LOG_DEFAULT_LEVEL_NONE=y

CONFIG_FREERTOS_HZ=1000
